<?php
// --------------------------------------------------------------
// json_decode()               JSON - PHP
// --------------------------------------------------------------
// 1) لتحويل اوبجكت من نوع جي سون مكتوب ضمن اقتباس النصي
//                إلى اوبجكت  بي اتش بي عادي او إلى ارراي 
// --------------------------------------------------------------
// 2) JSON OBJECT    يستخدم لفك تشفير 
// --------------------------------------------------------------
 
$data = '{ "name" : "coder shiyar" , "age":20  }';
$data = json_decode($data);
echo $data->name;
echo $data->age;

$data2 = '{ "name" : "coder shiyar" , "age":20  }';
$arrayData = json_decode($data2,true);

var_dump(json_last_error($arrayData)); ‎
?>
