<?php
// var_dump()
// ---------------------------------------------------------------------------------
//      وظيفتها عرض وإظهار نوع وقيمة المتغير، ومن الأمور التي يعتادها المبرمجين
//           هي استعمال هذه الدالة للتأكد من قيمة متغير ما, أي للأغراض التجريبية
//  ، وفي حالة المصفوفة تُظهر نوع المصفوفة مع عدد القيم قيمها، ونوع كل قيمة بها.
// ---------------------------------------------------------------------------------
// print_r()   
//                 تُظهر معلومات حول المتغيّر، نوعه ومحتواه، في حال المصفوفة تظهر
//                                المعلومات بشكل أبسط من سابقتها بالنسبة للمستخدم.

$data = 10;
var_dump($data);
echo "<br>";
print_r($data);
?>

