<?php
// ---------------------------------------------------------------------------------
// rand(min,max);                           لإنشاء رقم عشوائي بين عددين الذي تحدده 
// ---------------------------------------------------------------------------------
//   IN JAVASCRIPT -- في جافا سكريبت
// Math.ceil(Math.random() * 1000)       لجلب لك عدد عشوائي يتالف من عدد الذي تحدده
// Math.floor((Math.random() * 10) + 1) لجلب لك عدد عشوائي بين 1 و عدد الذي تحدده
echo rand(10,100);
?>
<script>
console.log(Math.ceil(Math.random() * 10000));

console.log(Math.floor((Math.random() * 100-19) + 20));
</script>