<?php 
// openssl_encrypt    وظيفة لتشفير البيانات 
// ---------------------------------------------------------
// openssl_decrypt  وظيفة لفك تشفير البيانات المشفرة
// ---------------------------------------------------------
// $data = هو البيانات الذي ترغب بتشفيرها او فك تشفيرها 
//         - بيانات يجب ان يكون من نوع البيانات النصي
// ---------------------------------------------------------
// $method = طريقة تشفير البيانات
// ---------------------------------------------------------
// $options = خيارات اضافية - ليس لدي فكرة عن استخداماتها
// ---------------------------------------------------------
// $iv = يقوم بتوليد مفاتيح فريدة لبيانات المشفرة
//               .يجب تحديد 16 رقم عشوائي كا قيمته
// openssl_encrypt ( string $data , string $method , string $key ,
//                   int $options = 0, string $iv = "") : string
$data = 'Password = 123456';
$key = 'codershiyar';
$iv = '1234567812345678';
$encryptedData = openssl_encrypt($data,'AES-256-CBC',$key,0,$iv);
echo $encryptedData . "<br>";
echo openssl_decrypt('fKyxxq2nTFSrt20CDoylJv9Vzo9a6/xSF1DvoNXrHCI=','AES-256-CBC',$key,0,$iv);

?>
